full/fp-why-bother-kotlin/slides.org
#+REVEAL_ROOT: ../../lib/reveal.js-4.1.1/
#+REVEAL_HLEVEL: 3
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h2>%a</h2>
#+REVEAL_TRANS: none

#+Title: FP: why bother?
#+Author: Jake Woods

#+OPTIONS: toc:nil
#+OPTIONS: num:nil

* What are we going to learn today?

** Nothing!
#+BEGIN_NOTES
- I'm not going to teach you anything.
- No sales pitches!
#+END_NOTES

* Instead! We're going to explore
#+BEGIN_NOTES
- Two things
#+END_NOTES

** How do functional programmers think about problems?
** Why do functional programmers bother with all this arcana?

* Caveat

** My experience is with *statically typed* FP
#+BEGIN_NOTES
- I.e. Haskell, Scala
- And now Kotlin
#+END_NOTES

** Dynamically typed FP is perfectly valid!
#+BEGIN_NOTES
- I.e. Clojure and... Ruby?
- I just don't do much of it so my examples are going to be biased
- Sorry!
#+END_NOTES

* Learning FP

** Purity
    #+BEGIN_SRC kotlin
    fun add(a: Int, b: Int): Int = a + b
    #+END_SRC

    #+ATTR_REVEAL: :frag (appear)
    #+BEGIN_SRC kotlin
    add(1, 1) // It returns 2! Purely!!
    #+END_SRC

** Recursion

    #+BEGIN_SRC kotlin
    fun fib(n: Int): Int =
      if(n == 0) {
        0
      } else {
        n + fib(n - 1)
      }
    }
    #+END_SRC

    #+ATTR_REVEAL: :frag (appear)
    #+BEGIN_SRC kotlin
    fib(4) // returns 10!
    #+END_SRC

** Currying

    #+BEGIN_SRC kotlin
    val add: (Int) -> (Int) -> Int = { a ->
      { b ->
        a + b
      }
    }
    #+END_SRC

    #+ATTR_REVEAL: :frag (appear)
    #+BEGIN_SRC kotlin
    val add1 = add(1)
    add1(2) // Returns 3! Cool!
    #+END_SRC

** List processing

    #+BEGIN_SRC kotlin
    // List processing:
    val numbers = listOf(1, 1, 1)

    numbers.map(i => i + 1).sum // Returns 6! Cool!
    #+END_SRC

* Back to reality

    #+BEGIN_SRC kotlin
    // Making decisions & causing side effects:
    fun makeLotsOfMoney(database: DbConnection) {
      val monies: Array<Float> = database.getMoney()

      var isThereEnoughMoney = true
      monies.forEach { money =>
        if(money < 1000000) {
          isThereEnoughMoney = false
        }
      }

      if(!isThereEnoughMoney && someBusinessThing() && !globalVariable) {
        doSomethingWithAWS()
      } else {
        globalVariable = true

        log.error(
          "Something bad happened but it's been happening for years so don't worry!"
        )

        doSomethingElseWithAWS()
      }
    }
    #+END_SRC

** They look completely different!
** How does this arcana relate to me?
** Why bother!?

* Why bother with anything?

** Programming
#+ATTR_REVEAL: :frag (appear)
   - Express problems to a computer
   - ... to make it do stuff
   - ... and maybe have some fun!

** Algorithms
#+ATTR_REVEAL: :frag (appear)
   - Express problems with math
   - ... to make it do new things it couldn't do before
   - ... to make it easier to solve problems

** Imperative programming
#+ATTR_REVEAL: :frag (appear)
   - Express problems in terms of imperative statements
   - ... to make computers do stuff
   - ... to make it easier to solve problems

** Object Oriented Programming
#+ATTR_REVEAL: :frag (appear)
   - Express problems in terms of objects
   - ... to make computers do stuff
   - ... to make it easier to solve problems

** Functional Programming
#+ATTR_REVEAL: :frag (appear)
   - Express problems in terms of functions
   - ... to make computers do stuff
   - ... to make it easier to solve problems

** It's not a competition
*** Functional programming *is not* morally better
*** But we enjoy it

* Why bother with FP?
** Because pure functions are gods gift to the mortal world.
** Because _we believe_ pure functions are gods gift to the mortal world.

** A totally legitimate description of pure functions

#+ATTR_REVEAL: :frag (appear)
  - Behavior *only* depends on parameters
  - Output *only* by returning a value
  - No user-detectable changes to the computer
    - No logs, no drawing things, no network access, nothing!

