full/fp-why-bother-kotlin/slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>FP: why bother?</title>
<meta name="author" content="Jake Woods"/>
<link rel="stylesheet" href="../../lib/reveal.js-4.1.1/dist/reveal.css"/>

<link rel="stylesheet" href="../../lib/reveal.js-4.1.1/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>FP: why bother?</h1><h2>Jake Woods</h2>
</section>

<section>
<section id="slide-orgd733338">
<h2 id="orgd733338">What are we going to learn today?</h2>
<div class="outline-text-2" id="text-orgd733338">
</div>
</section>
</section>
<section>
<section id="slide-org0899c5a">
<h3 id="org0899c5a">Nothing!</h3>
<aside class="notes">
<ul>
<li>I&rsquo;m not going to teach you anything.</li>
<li>No sales pitches!</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-orgdecb8e2">
<h2 id="orgdecb8e2">Instead! We&rsquo;re going to explore</h2>
<aside class="notes">
<ul>
<li>Two things</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-orgf461c9e">
<h3 id="orgf461c9e">How do functional programmers think about problems?</h3>
</section>
</section>
<section>
<section id="slide-org3c766f1">
<h3 id="org3c766f1">Why do functional programmers bother with all this arcana?</h3>

</section>
</section>
<section>
<section id="slide-orgecb38bf">
<h2 id="orgecb38bf">Caveat</h2>
<div class="outline-text-2" id="text-orgecb38bf">
</div>
</section>
</section>
<section>
<section id="slide-orgd295099">
<h3 id="orgd295099">My experience is with <b>statically typed</b> FP</h3>
<aside class="notes">
<ul>
<li>I.e. Haskell, Scala</li>
<li>And now Kotlin</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org58d5176">
<h3 id="org58d5176">Dynamically typed FP is perfectly valid!</h3>
<aside class="notes">
<ul>
<li>I.e. Clojure and&#x2026; Ruby?</li>
<li>I just don&rsquo;t do much of it so my examples are going to be biased</li>
<li>Sorry!</li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-orge09ba1a">
<h2 id="orge09ba1a">Learning FP</h2>
<div class="outline-text-2" id="text-orge09ba1a">
</div>
</section>
</section>
<section>
<section id="slide-org0c19fbd">
<h3 id="org0c19fbd">Purity</h3>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #0000FF;">fun</span> <span style="color: #006699;">add</span>(a: <span style="color: #6434A3;">Int</span>, b: <span style="color: #6434A3;">Int</span>): <span style="color: #6434A3;">Int</span> = a + b
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)">    add(<span style="color: #D0372D;">1</span>, <span style="color: #D0372D;">1</span>) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">It returns 2! Purely!!</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orge392202">
<h3 id="orge392202">Recursion</h3>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #0000FF;">fun</span> <span style="color: #006699;">fib</span>(n: <span style="color: #6434A3;">Int</span>): <span style="color: #6434A3;">Int</span> =
      <span style="color: #0000FF;">if</span>(n == <span style="color: #D0372D;">0</span>) {
        <span style="color: #D0372D;">0</span>
      } <span style="color: #0000FF;">else</span> {
        n + fib(n - <span style="color: #D0372D;">1</span>)
      }
    }
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)">    fib(<span style="color: #D0372D;">4</span>) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">returns 10!</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org1b4c3fe">
<h3 id="org1b4c3fe">Currying</h3>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">add</span>: (<span style="color: #6434A3;">Int</span>) -&gt; (<span style="color: #6434A3;">Int</span>) -&gt; <span style="color: #6434A3;">Int</span> = { a -&gt;
      { b -&gt;
        a + b
      }
    }
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)">    <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">add1</span> = add(<span style="color: #D0372D;">1</span>)
    add1(<span style="color: #D0372D;">2</span>) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Returns 3! Cool!</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org092904b">
<h3 id="org092904b">List processing</h3>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">List processing:</span>
    <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">numbers</span> = listOf(<span style="color: #D0372D;">1</span>, <span style="color: #D0372D;">1</span>, <span style="color: #D0372D;">1</span>)

    numbers.map(i =&gt; i + <span style="color: #D0372D;">1</span>).sum <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Returns 6! Cool!</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org813f179">
<h2 id="org813f179">Back to reality</h2>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Making decisions &amp; causing side effects:</span>
    <span style="color: #0000FF;">fun</span> <span style="color: #006699;">makeLotsOfMoney</span>(database: <span style="color: #6434A3;">DbConnection</span>) {
      <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">monies</span>: <span style="color: #6434A3;">Array&lt;Float&gt;</span> = database.getMoney()

      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">isThereEnoughMoney</span> = <span style="color: #D0372D;">true</span>
      monies.forEach { money =&gt;
        <span style="color: #0000FF;">if</span>(money &lt; <span style="color: #D0372D;">1000000</span>) {
          isThereEnoughMoney = <span style="color: #D0372D;">false</span>
        }
      }

      <span style="color: #0000FF;">if</span>(!isThereEnoughMoney &amp;&amp; someBusinessThing() &amp;&amp; !globalVariable) {
        doSomethingWithAWS()
      } <span style="color: #0000FF;">else</span> {
        globalVariable = <span style="color: #D0372D;">true</span>

        log.error(
          <span style="color: #008000;">"Something bad happened but it's been happening for years so don't worry!"</span>
        )

        doSomethingElseWithAWS()
      }
    }
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org0509898">
<h3 id="org0509898">They look completely different!</h3>
</section>
</section>
<section>
<section id="slide-orgc9bc564">
<h3 id="orgc9bc564">How does this arcana relate to me?</h3>
</section>
</section>
<section>
<section id="slide-orgda9ed75">
<h3 id="orgda9ed75">Why bother!?</h3>

</section>
</section>
<section>
<section id="slide-org7eb0681">
<h2 id="org7eb0681">Why bother with anything?</h2>
<div class="outline-text-2" id="text-org7eb0681">
</div>
</section>
</section>
<section>
<section id="slide-org3753c8e">
<h3 id="org3753c8e">Programming</h3>
<ul>
<li class="fragment appear">Express problems to a computer</li>
<li class="fragment appear">&#x2026; to make it do stuff</li>
<li class="fragment appear">&#x2026; and maybe have some fun!</li>

</ul>

</section>
</section>
<section>
<section id="slide-org446c458">
<h3 id="org446c458">Algorithms</h3>
<ul>
<li class="fragment appear">Express problems with math</li>
<li class="fragment appear">&#x2026; to make it do new things it couldn&rsquo;t do before</li>
<li class="fragment appear">&#x2026; to make it easier to solve problems</li>

</ul>

</section>
</section>
<section>
<section id="slide-org81c32bf">
<h3 id="org81c32bf">Design patterns</h3>
<ul>
<li class="fragment appear">Express problems with cargo cult code copying</li>
<li class="fragment appear">&#x2026; to suck the fun out of everything</li>
<li class="fragment appear">&#x2026; to make it easier to solve problems??</li>
<li class="fragment appear">&#x2026; I&rsquo;m looking at you ProxyAbstractFactorySingletonBeanManagerDecorator!</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgb9c0033">
<h3 id="orgb9c0033">Imperative programming</h3>
<ul>
<li class="fragment appear">Express problems in terms of imperative statements</li>
<li class="fragment appear">&#x2026; to make computers do stuff</li>
<li class="fragment appear">&#x2026; to make it easier to solve problems</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd64a40a">
<h3 id="orgd64a40a">Object Oriented Programming</h3>
<ul>
<li class="fragment appear">Express problems in terms of objects</li>
<li class="fragment appear">&#x2026; to make computers do stuff</li>
<li class="fragment appear">&#x2026; to make it easier to solve problems</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgc2c85be">
<h3 id="orgc2c85be">Functional Programming</h3>
<ul>
<li class="fragment appear">Express problems in terms of functions</li>
<li class="fragment appear">&#x2026; to make computers do stuff</li>
<li class="fragment appear">&#x2026; to make it easier to solve problems</li>

</ul>

</section>
</section>
<section>
<section id="slide-org4c537f4">
<h3 id="org4c537f4">It&rsquo;s not a competition</h3>
<div class="outline-text-3" id="text-org4c537f4">
</div>
</section>
</section>
<section>
<section id="slide-org9de0fa6">
<h4 id="org9de0fa6">Functional programming <b>is not</b> morally better</h4>
</section>
</section>
<section>
<section id="slide-orgc4c5fca">
<h4 id="orgc4c5fca">But we enjoy it</h4>

</section>
</section>
<section>
<section id="slide-org0a32c01">
<h2 id="org0a32c01">Why bother with FP?</h2>
<div class="outline-text-2" id="text-org0a32c01">
</div>
</section>
</section>
<section>
<section id="slide-orgdce11e2">
<h3 id="orgdce11e2">Because pure functions are gods gift to the mortal world.</h3>
</section>
</section>
<section>
<section id="slide-org243d95e">
<h3 id="org243d95e">Because <span class="underline">we believe</span> pure functions are gods gift to the mortal world.</h3>

</section>
</section>
<section>
<section id="slide-org569383c">
<h3 id="org569383c">A totally legitimate description of pure functions</h3>
<ul>
<li class="fragment appear">Behavior <b>only</b> depends on parameters</li>
<li class="fragment appear">Output <b>only</b> by returning a value</li>
<li class="fragment appear">No user-detectable changes to the computer
<ul>
<li>No logs, no drawing things, no network access, nothing!</li>

</ul></li>

</ul>

</section>
</section>
