full/fp-why-bother-kotlin/slides.org
** Impure example

    #+BEGIN_SRC kotlin
    // Games in the datbase: ["Dwarf Fortress", "Duke Nukem Forever", "Prey", "E.T."]
    var gameDatabase: List<String> = gameServer.getGameDatabase

    // Impure
    fun removeBadGames(): Unit = {
      gameDatabase.remove("Duke Nukem Forever")
      gameDatabase.remove("E.T.")
    }

    removeBadGames()
    println(gameDatabase) // ["Dwarf Fortress", "Prey"]!
    #+END_SRC

** Pure Example

    #+BEGIN_SRC kotlin
    // Games in the datbase: ["Dwarf Fortress", "Duke Nukem Forever", "Prey", "E.T."]
    val gameDatabase = gameServer.getGameDatabase

    // Pure
    fun removeBadGames(games: List<String>): List<String> = {
      games
        .filter(_ ==  "Duke Nukem Forever")
        .filter(_ == "E.T.")
    }

    val goodGames = filterBadGames(gameDatabase)
    println(goodGames) // ["Dwarf Fortress", "Prey"]
    #+END_SRC

** Benefit - Testing

  #+BEGIN_SRC kotlin
  class RemoveBadGamesTest {
    @Test
    fun `do not remove Prey`() {
      val games = listOf("Prey")
      assertThat(removeBadGames(game)).isEqualTo(games)
    }

    @Test
    fun `remove Duke Nukem Forever`() {
      val games = listOf("Duke Nukem Forever")
      assertThat(removeBadGames(games)).isEmpty()
    }

    @Test
    fun `remove E.T.`() {
      val games = listOf("E.T.")
    }
  }
  #+END_SRC

** Benefit - Local Context
#+BEGIN_NOTES
- Everything you need to know is in one place.
- I _know_ for a fact that ~removeBadGames~ only uses an list of strings. *Nothing else*!
- I also know it's not going to do something unexpected!
#+END_NOTES

  #+BEGIN_SRC kotlin
    fun removeBadGames(games: List<String>): List<String> = {
      games
        .filter(_ ==  "Duke Nukem Forever")
        .filter(_ == "E.T.")
    }
  #+END_SRC

** Benefit - Honest Types
#+BEGIN_NOTES
- The static typing is actually telling the truth!
- This function is making a promise: Give me some strings and I will give you back some strings. *Nothing more, nothing less*
#+END_NOTES

  #+BEGIN_SRC kotlin
  fun removeBadGames(games: List<String>): List<String>
  #+END_SRC

#+ATTR_REVEAL: :frag (appear)
Pure functions are good friends: *They keep promises*

** Drawbacks
#+ATTR_REVEAL: :frag (appear)
Pure functions can't do anything!

** Things of note if you accept pure functions as your lord and saviour
#+ATTR_REVEAL: :frag (appear)
- Immutability becomes an obvious choice
- Objects start to look a lot less useful
- Since you've got lots of pure functions you need new techniques to manage them

* Lock the doors, it's _Monad_ time

#+ATTR_REVEAL: :frag (appear)
Just kidding

** How many of you had a fear response just then?

** The functional arcana is scary

** It looks impenetrable

** So why do we do it?

** Each scary buzzword is a _solution to a problem_
A solution that leverages pure functions

*** Immutability
Makes it possible to write pure functions

*** Functors
Makes it easier to apply functions to different types of containers

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC kotlin
fun add5(input: Int): Int = input + 5
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC kotlin
// add5 works on ints!
add5(10) // Returns 15
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC kotlin
// Functor lets us use it on lists!
List(1,2,3).map(add5) // returns List(6,7,8)
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC kotlin
// ?.let is "nullable map"
val value: Int? = 20
value?.let(add5) // Returns 25
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC kotlin
// And Future!
Future(1).map(add5) // Returns Future(6)
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
And lots of other stuff!

*** Applicatives
Combine functions in parallel

*** Monads
Sequence functions together

#+ATTR_REVEAL: :frag (appear)
This is used for IO in FP as IO is sequential!

#+ATTR_REVEAL: :frag (appear)
Monads are _not_ the core of FP and you can do FP without monads.

*** Fold
Makes it easier to apply functions to recursive data

*** Traverse
Makes it easier to apply functions to nested data structures

*** Typeclasses
Make it easier to pick which function to apply to some data

*** Free/Eff
- Compile functions into more functions
- Compose monads

** They're all solutions to _real world problems_

* But Jake - Why do _you_ bother!?

** I wanted to make *Video Games*!
   #+ATTR_REVEAL: :frag (appear)
   - So I learned Visual Basic 6
   - And used it to build crappy games

** Then I learned about _OOP_!
   #+ATTR_REVEAL: :frag (appear)
   - Lots of C++
   - Lots of objects
   - Everything was great!

