full/fp-why-bother-kotlin/slides.html
<section>
<section id="slide-org89125b7">
<h3 id="org89125b7">Impure example</h3>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Games in the datbase: ["Dwarf Fortress", "Duke Nukem Forever", "Prey", "E.T."]</span>
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">gameDatabase</span>: <span style="color: #6434A3;">List&lt;String&gt;</span> = gameServer.getGameDatabase

    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Impure</span>
    <span style="color: #0000FF;">fun</span> <span style="color: #006699;">removeBadGames</span>(): <span style="color: #6434A3;">Unit</span> = {
      gameDatabase.remove(<span style="color: #008000;">"Duke Nukem Forever"</span>)
      gameDatabase.remove(<span style="color: #008000;">"E.T."</span>)
    }

    removeBadGames()
    println(gameDatabase) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">["Dwarf Fortress", "Prey"]!</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org73d76e8">
<h3 id="org73d76e8">Pure Example</h3>
<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Games in the datbase: ["Dwarf Fortress", "Duke Nukem Forever", "Prey", "E.T."]</span>
    <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">gameDatabase</span> = gameServer.getGameDatabase

    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Pure</span>
    <span style="color: #0000FF;">fun</span> <span style="color: #006699;">removeBadGames</span>(games: <span style="color: #6434A3;">List&lt;String&gt;</span>): <span style="color: #6434A3;">List&lt;String&gt;</span> = {
      games
        .filter(_ ==  <span style="color: #008000;">"Duke Nukem Forever"</span>)
        .filter(_ == <span style="color: #008000;">"E.T."</span>)
    }

    <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">goodGames</span> = filterBadGames(gameDatabase)
    println(goodGames) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">["Dwarf Fortress", "Prey"]</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org9af1c13">
<h3 id="org9af1c13">Benefit - Testing</h3>
<div class="org-src-container">

<pre class="src src-kotlin">  <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">RemoveBadGamesTest</span> {
    @<span style="color: #6434A3;">Test</span>
    <span style="color: #0000FF;">fun</span> <span style="color: #008000;">`do not remove Prey`</span>() {
      <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">games</span> = listOf(<span style="color: #008000;">"Prey"</span>)
      assertThat(removeBadGames(game)).isEqualTo(games)
    }

    @<span style="color: #6434A3;">Test</span>
    <span style="color: #0000FF;">fun</span> <span style="color: #008000;">`remove Duke Nukem Forever`</span>() {
      <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">games</span> = listOf(<span style="color: #008000;">"Duke Nukem Forever"</span>)
      assertThat(removeBadGames(games)).isEmpty()
    }

    @<span style="color: #6434A3;">Test</span>
    <span style="color: #0000FF;">fun</span> <span style="color: #008000;">`remove E.T.`</span>() {
      <span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">games</span> = listOf(<span style="color: #008000;">"E.T."</span>)
    }
  }
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org724b815">
<h3 id="org724b815">Benefit - Local Context</h3>
<aside class="notes">
<ul>
<li>Everything you need to know is in one place.</li>
<li>I <span class="underline">know</span> for a fact that <code>removeBadGames</code> only uses an list of strings. <b>Nothing else</b>!</li>
<li>I also know it&rsquo;s not going to do something unexpected!</li>

</ul>

</aside>

<div class="org-src-container">

<pre class="src src-kotlin">    <span style="color: #0000FF;">fun</span> <span style="color: #006699;">removeBadGames</span>(games: <span style="color: #6434A3;">List&lt;String&gt;</span>): <span style="color: #6434A3;">List&lt;String&gt;</span> = {
      games
        .filter(_ ==  <span style="color: #008000;">"Duke Nukem Forever"</span>)
        .filter(_ == <span style="color: #008000;">"E.T."</span>)
    }
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org2e07ec4">
<h3 id="org2e07ec4">Benefit - Honest Types</h3>
<aside class="notes">
<ul>
<li>The static typing is actually telling the truth!</li>
<li>This function is making a promise: Give me some strings and I will give you back some strings. <b>Nothing more, nothing less</b></li>

</ul>

</aside>

<div class="org-src-container">

<pre class="src src-kotlin">  <span style="color: #0000FF;">fun</span> <span style="color: #006699;">removeBadGames</span>(games: <span style="color: #6434A3;">List&lt;String&gt;</span>): <span style="color: #6434A3;">List&lt;String&gt;</span>
</pre>
</div>

<p class="fragment (appear)">
Pure functions are good friends: <b>They keep promises</b>
</p>

</section>
</section>
<section>
<section id="slide-orgc23e4a6">
<h3 id="orgc23e4a6">Drawbacks</h3>
<p class="fragment (appear)">
Pure functions can&rsquo;t do anything!
</p>

</section>
</section>
<section>
<section id="slide-orga35eb8d">
<h3 id="orga35eb8d">Things of note if you accept pure functions as your lord and saviour</h3>
<ul>
<li class="fragment appear">Immutability becomes an obvious choice</li>
<li class="fragment appear">Objects start to look a lot less useful</li>
<li class="fragment appear">Since you&rsquo;ve got lots of pure functions you need new techniques to manage them</li>

</ul>

</section>
</section>
<section>
<section id="slide-org8363755">
<h2 id="org8363755">Lock the doors, it&rsquo;s <span class="underline">Monad</span> time</h2>
<p class="fragment (appear)">
Just kidding
</p>

</section>
</section>
<section>
<section id="slide-orgdb5cc70">
<h3 id="orgdb5cc70">How many of you had a fear response just then?</h3>

</section>
</section>
<section>
<section id="slide-org3e47f06">
<h3 id="org3e47f06">The functional arcana is scary</h3>

</section>
</section>
<section>
<section id="slide-orgb06ebfa">
<h3 id="orgb06ebfa">It looks impenetrable</h3>

</section>
</section>
<section>
<section id="slide-org4c9e299">
<h3 id="org4c9e299">So why do we do it?</h3>

</section>
</section>
<section>
<section id="slide-orgddb7dc9">
<h3 id="orgddb7dc9">Each scary buzzword is a <span class="underline">solution to a problem</span></h3>
<p>
A solution that leverages pure functions
</p>

</section>
</section>
<section>
<section id="slide-orga309ea8">
<h4 id="orga309ea8">Immutability</h4>
<p>
Makes it possible to write pure functions
</p>

</section>
</section>
<section>
<section id="slide-orgbb386d6">
<h4 id="orgbb386d6">Functors</h4>
<p>
Makes it easier to apply functions to different types of containers
</p>

<div class="org-src-container">

<pre class="fragment (appear)"><span style="color: #0000FF;">fun</span> <span style="color: #006699;">add5</span>(input: <span style="color: #6434A3;">Int</span>): <span style="color: #6434A3;">Int</span> = input + <span style="color: #D0372D;">5</span>
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">add5 works on ints!</span>
add5(<span style="color: #D0372D;">10</span>) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Returns 15</span>
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Functor lets us use it on lists!</span>
<span style="color: #6434A3;">List</span>(<span style="color: #D0372D;">1</span>,<span style="color: #D0372D;">2</span>,<span style="color: #D0372D;">3</span>).map(add5) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">returns List(6,7,8)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">?.let is "nullable map"</span>
<span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">value</span>: <span style="color: #6434A3;">Int?</span> = <span style="color: #D0372D;">20</span>
value?.let(add5) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Returns 25</span>
</pre>
</div>

<div class="org-src-container">

<pre class="fragment (appear)"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">And Future!</span>
<span style="color: #6434A3;">Future</span>(<span style="color: #D0372D;">1</span>).map(add5) <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Returns Future(6)</span>
</pre>
</div>

<p class="fragment (appear)">
And lots of other stuff!
</p>

</section>
</section>
<section>
<section id="slide-orgc97db77">
<h4 id="orgc97db77">Applicatives</h4>
<p>
Combine functions in parallel
</p>

</section>
</section>
<section>
<section id="slide-orgfcad8fb">
<h4 id="orgfcad8fb">Monads</h4>
<p>
Sequence functions together
</p>

<p class="fragment (appear)">
This is used for IO in FP as IO is sequential!
</p>

<p class="fragment (appear)">
Monads are <span class="underline">not</span> the core of FP and you can do FP without monads.
</p>

</section>
</section>
<section>
<section id="slide-org248362a">
<h4 id="org248362a">Fold</h4>
<p>
Makes it easier to apply functions to recursive data
</p>

</section>
</section>
<section>
<section id="slide-org5a1bf5a">
<h4 id="org5a1bf5a">Traverse</h4>
<p>
Makes it easier to apply functions to nested data structures
</p>

</section>
</section>
<section>
<section id="slide-org3853830">
<h4 id="org3853830">Typeclasses</h4>
<p>
Make it easier to pick which function to apply to some data
</p>

</section>
</section>
<section>
<section id="slide-orgd51820c">
<h4 id="orgd51820c">Free/Eff</h4>
<ul>
<li>Compile functions into more functions</li>
<li>Compose monads</li>

</ul>

</section>
</section>
<section>
<section id="slide-org9caa58d">
<h3 id="org9caa58d">They&rsquo;re all solutions to <span class="underline">real world problems</span></h3>

</section>
</section>
<section>
<section id="slide-orgf6a0fb9">
<h2 id="orgf6a0fb9">But Jake - Why do <span class="underline">you</span> bother!?</h2>
<div class="outline-text-2" id="text-orgf6a0fb9">
</div>
</section>
</section>
<section>
<section id="slide-orgc202a63">
<h3 id="orgc202a63">I wanted to make <b>Video Games</b>!</h3>
<ul>
<li class="fragment appear">So I learned Visual Basic 6</li>
<li class="fragment appear">And used it to build crappy games</li>

</ul>

</section>
</section>
<section>
<section id="slide-org0e2f73c">
<h3 id="org0e2f73c">Then I learned about <span class="underline">OOP</span>!</h3>
<ul>
<li class="fragment appear">Lots of C++</li>
<li class="fragment appear">Lots of objects</li>
<li class="fragment appear">Everything was great!</li>

</ul>

</section>
</section>
